results/task#2/wrk_get.txt
leo@leo-VirtualBox:~/techpol/wrk_tests$ wrk -t4 -c200 -d30s -sget.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 1.383ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.572ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.405ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.378ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.75ms    2.32ms  46.37ms   95.24%
    Req/Sec   530.34    741.62     5.55k    96.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.35ms
 75.000%    1.97ms
 90.000%    3.04ms
 99.000%    8.11ms
 99.900%   38.30ms
 99.990%   44.51ms
 99.999%   46.40ms
100.000%   46.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.075     0.000000            1         1.00
       0.537     0.100000         3948         1.11
       0.767     0.200000         7901         1.25
       0.971     0.300000        11837         1.43
       1.164     0.400000        15799         1.67
       1.354     0.500000        19748         2.00
       1.447     0.550000        21713         2.22
       1.553     0.600000        23681         2.50
       1.669     0.650000        25653         2.86
       1.811     0.700000        27626         3.33
       1.972     0.750000        29595         4.00
       2.073     0.775000        30604         4.44
       2.187     0.800000        31565         5.00
       2.337     0.825000        32555         5.71
       2.507     0.850000        33543         6.67
       2.731     0.875000        34524         8.00
       2.875     0.887500        35021         8.89
       3.041     0.900000        35522        10.00
       3.231     0.912500        36009        11.43
       3.451     0.925000        36498        13.33
       3.713     0.937500        36991        16.00
       3.865     0.943750        37238        17.78
       4.015     0.950000        37485        20.00
       4.187     0.956250        37738        22.86
       4.399     0.962500        37978        26.67
       4.651     0.968750        38227        32.00
       4.791     0.971875        38347        35.56
       5.019     0.975000        38471        40.00
       5.295     0.978125        38595        45.71
       5.715     0.981250        38717        53.33
       6.331     0.984375        38840        64.00
       6.867     0.985938        38902        71.11
       7.239     0.987500        38963        80.00
       7.783     0.989062        39025        91.43
       8.519     0.990625        39087       106.67
       9.743     0.992188        39148       128.00
      10.455     0.992969        39179       142.22
      11.135     0.993750        39210       160.00
      12.655     0.994531        39241       182.86
      14.095     0.995313        39272       213.33
      15.687     0.996094        39302       256.00
      20.127     0.996484        39318       284.44
      22.607     0.996875        39333       320.00
      25.855     0.997266        39349       365.71
      28.031     0.997656        39364       426.67
      31.295     0.998047        39379       512.00
      33.439     0.998242        39387       568.89
      35.071     0.998437        39395       640.00
      35.935     0.998633        39403       731.43
      36.543     0.998828        39410       853.33
      38.527     0.999023        39418      1024.00
      39.039     0.999121        39423      1137.78
      39.359     0.999219        39426      1280.00
      40.447     0.999316        39431      1462.86
      40.479     0.999414        39433      1706.67
      41.183     0.999512        39438      2048.00
      41.215     0.999561        39439      2275.56
      41.343     0.999609        39441      2560.00
      41.407     0.999658        39443      2925.71
      41.887     0.999707        39445      3413.33
      42.623     0.999756        39447      4096.00
      43.967     0.999780        39448      4551.11
      44.031     0.999805        39449      5120.00
      44.447     0.999829        39450      5851.43
      44.479     0.999854        39451      6826.67
      44.511     0.999878        39453      8192.00
      44.511     0.999890        39453      9102.22
      44.511     0.999902        39453     10240.00
      44.511     0.999915        39453     11702.86
      44.607     0.999927        39454     13653.33
      44.607     0.999939        39454     16384.00
      44.607     0.999945        39454     18204.44
      45.439     0.999951        39455     20480.00
      45.439     0.999957        39455     23405.71
      45.439     0.999963        39455     27306.67
      45.439     0.999969        39455     32768.00
      45.439     0.999973        39455     36408.89
      46.399     0.999976        39456     40960.00
      46.399     1.000000        39456          inf
#[Mean    =        1.754, StdDeviation   =        2.316]
#[Max     =       46.368, Total count    =        39456]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59384 requests in 30.00s, 4.70MB read
  Non-2xx or 3xx responses: 59384
Requests/sec:   1979.60
Transfer/sec:    160.46KB