results/task#2/wrk_put.txt
leo@leo-VirtualBox:~/techpol/wrk_tests$ wrk -t4 -c200 -d30s -sput.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 2.427ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.790ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.778ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.612ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.80ms    1.47ms  42.05ms   88.36%
    Req/Sec   528.67      1.05k    5.55k    94.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.50ms
 75.000%    2.22ms
 90.000%    3.23ms
 99.000%    6.55ms
 99.900%   12.21ms
 99.990%   40.48ms
 99.999%   42.08ms
100.000%   42.08ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.105     0.000000            1         1.00
       0.628     0.100000         3954         1.11
       0.881     0.200000         7895         1.25
       1.100     0.300000        11837         1.43
       1.296     0.400000        15784         1.67
       1.496     0.500000        19726         2.00
       1.603     0.550000        21692         2.22
       1.722     0.600000        23674         2.50
       1.860     0.650000        25639         2.86
       2.027     0.700000        27620         3.33
       2.217     0.750000        29591         4.00
       2.325     0.775000        30570         4.44
       2.449     0.800000        31562         5.00
       2.593     0.825000        32540         5.71
       2.765     0.850000        33524         6.67
       2.979     0.875000        34519         8.00
       3.095     0.887500        35002         8.89
       3.231     0.900000        35498        10.00
       3.379     0.912500        35988        11.43
       3.555     0.925000        36485        13.33
       3.759     0.937500        36978        16.00
       3.883     0.943750        37220        17.78
       4.013     0.950000        37470        20.00
       4.191     0.956250        37720        22.86
       4.387     0.962500        37960        26.67
       4.607     0.968750        38207        32.00
       4.739     0.971875        38330        35.56
       4.911     0.975000        38454        40.00
       5.127     0.978125        38577        45.71
       5.359     0.981250        38699        53.33
       5.675     0.984375        38823        64.00
       5.855     0.985938        38885        71.11
       6.099     0.987500        38947        80.00
       6.323     0.989062        39007        91.43
       6.699     0.990625        39069       106.67
       6.991     0.992188        39130       128.00
       7.207     0.992969        39161       142.22
       7.579     0.993750        39192       160.00
       7.963     0.994531        39223       182.86
       8.359     0.995313        39254       213.33
       8.743     0.996094        39284       256.00
       9.119     0.996484        39300       284.44
       9.383     0.996875        39315       320.00
       9.943     0.997266        39331       365.71
      10.471     0.997656        39347       426.67
      10.911     0.998047        39361       512.00
      11.295     0.998242        39369       568.89
      11.615     0.998437        39377       640.00
      11.815     0.998633        39385       731.43
      12.039     0.998828        39392       853.33
      12.503     0.999023        39400      1024.00
      12.823     0.999121        39404      1137.78
      14.287     0.999219        39408      1280.00
      16.655     0.999316        39413      1462.86
      20.687     0.999414        39415      1706.67
      25.263     0.999512        39419      2048.00
      26.655     0.999561        39421      2275.56
      29.503     0.999609        39423      2560.00
      31.167     0.999658        39425      2925.71
      34.335     0.999707        39427      3413.33
      34.815     0.999756        39429      4096.00
      35.679     0.999780        39430      4551.11
      35.999     0.999805        39431      5120.00
      36.575     0.999829        39432      5851.43
      39.903     0.999854        39433      6826.67
      40.479     0.999878        39434      8192.00
      40.479     0.999890        39434      9102.22
      40.703     0.999902        39435     10240.00
      40.703     0.999915        39435     11702.86
      40.927     0.999927        39436     13653.33
      40.927     0.999939        39436     16384.00
      40.927     0.999945        39436     18204.44
      41.407     0.999951        39437     20480.00
      41.407     0.999957        39437     23405.71
      41.407     0.999963        39437     27306.67
      41.407     0.999969        39437     32768.00
      41.407     0.999973        39437     36408.89
      42.079     0.999976        39438     40960.00
      42.079     1.000000        39438          inf
#[Mean    =        1.801, StdDeviation   =        1.469]
#[Max     =       42.048, Total count    =        39438]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58923 requests in 30.00s, 3.76MB read
Requests/sec:   1964.07
Transfer/sec:    128.51KB